<a href="https://colab.research.google.com/github/antonychackotc/Northwind-traders-Project-DashQuest-live-/blob/main/Nw_tr4_EDA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [10]:
df=pd.read_csv('/content/cleaned-nw-traders.csv')
df.head()

,Unnamed: 0.1,Unnamed: 0,shipperID,employeeID,employeeName,title,reportsTo,categoryID,categoryName,description,...,orderDate,requiredDate,shippedDate,freight,quantity,discount,unitPrice,country,city,companyName
0,0,0,1,1,Nancy Davolio,Sales Representative,8.0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",...,2013-07-17,2013-08-14,2013-07-23,140.51,50,0.20,19.0,USA,New York,Speedy Express
1,1,1,1,1,Nancy Davolio,Sales Representative,8.0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",...,2015-04-01,2015-04-29,2015-04-07,38.51,50,0.20,19.0,USA,New York,Speedy Express
2,2,2,1,1,Nancy Davolio,Sales Representative,8.0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",...,2015-01-05,2015-02-02,2015-01-09,47.38,12,0.20,19.0,USA,New York,Speedy Express
3,3,3,1,1,Nancy Davolio,Sales Representative,8.0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",...,2014-03-10,2014-04-07,2014-03-14,60.18,40,0.15,19.0,USA,New York,Speedy Express
4,4,4,1,1,Nancy Davolio,Sales Representative,8.0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",...,2015-04-16,2015-05-14,2015-04-20,52.52,30,0.25,4.5,USA,New York,Speedy Express

In [11]:
df.drop(columns=['Unnamed: 0','Unnamed: 0.1'],axis=1,inplace=True)

# **Exploratory Data Analysis (EDA)**

In [13]:
# Categorical and numerical column detection
categorical_columns = df.select_dtypes(include=['object', 'category']).columns.tolist()
numerical_columns = df.select_dtypes(include=['number']).columns.tolist()

print("Categorical Columns:", categorical_columns)
print("Numerical Columns:", numerical_columns)

Categorical Columns: ['employeeName', 'title', 'categoryName', 'description', 'productName', 'quantityPerUnit', 'customerID', 'contactName', 'contactTitle', 'orderDate', 'requiredDate', 'shippedDate', 'country', 'city', 'companyName']
Numerical Columns: ['shipperID', 'employeeID', 'reportsTo', 'categoryID', 'productID', 'discontinued', 'orderID', 'freight', 'quantity', 'discount', 'unitPrice']

# **Check category column value check for Analysis**

# **1)**

In [15]:
df['employeeName'].value_counts()

employeeName
Margaret Peacock    420
Nancy Davolio       345
Janet Leverling     321
Laura Callahan      260
Andrew Fuller       241
Robert King         176
Michael Suyama      168
Steven Buchanan     117
Anne Dodsworth      107
Name: count, dtype: int64

# **this column is suite for EDA because this columns contains Cluster Bases**

# **2)**

In [17]:
df['title'].value_counts()

title
Sales Representative    1537
Sales Manager            377
Vice President Sales     241
Name: count, dtype: int64

# **this column is suite for EDA because this columns contains Cluster Bases**

# **3)**

In [18]:
df['categoryName'].value_counts()

categoryName
Beverages           404
Dairy Products      366
Confections         334
Seafood             330
Condiments          216
Grains & Cereals    196
Meat & Poultry      173
Produce             136
Name: count, dtype: int64

# **this column is suite for EDA because this columns contains Cluster Bases**

# **4)**

In [19]:
df['description'].value_counts()

description
Soft drinks, coffees, teas, beers, and ales                   404
Cheeses                                                       366
Desserts, candies, and sweet breads                           334
Seaweed and fish                                              330
Sweet and savory sauces, relishes, spreads, and seasonings    216
Breads, crackers, pasta, and cereal                           196
Prepared meats                                                173
Dried fruit and bean curd                                     136
Name: count, dtype: int64

# **This columns also Best for EDA - like Asociate Learning (clusters)**

# **5)**

In [27]:
df['country'].value_counts()

country
USA    1587
UK      568
Name: count, dtype: int64

# **6)**

In [29]:
df['city'].value_counts()

city
New York    1587
London       568
Name: count, dtype: int64

# **7)**

In [30]:
df['companyName'].value_counts()

companyName
United Package      864
Speedy Express      646
Federal Shipping    645
Name: count, dtype: int64

# **8)**

In [34]:
df['contactTitle'].value_counts()

contactTitle
Sales Representative              414
Owner                             347
Sales Manager                     342
Accounting Manager                311
Marketing Manager                 185
Sales Associate                   160
Marketing Assistant               118
Sales Agent                        85
Assistant Sales Representative     71
Order Administrator                62
Assistant Sales Agent              43
Owner/Marketing Assistant          17
Name: count, dtype: int64

In [31]:
############################################################################################################################

# **SQL BASED COLUMNS**

# **1)**

In [20]:
df['productName'].value_counts()

productName
Raclette Courdavault         54
Camembert Pierrot            51
Gorgonzola Telino            51
Guarana Fantastica           51
Gnocchi di nonna Alice       50
                             ..
Louisiana Hot Spiced Okra     8
Genen Shouyu                  6
Chocolade                     6
Gravad lax                    6
Mishi Kobe Niku               5
Name: count, Length: 77, dtype: int64

# **This Product used for SQL method to Analyse a Product**

# **2)**

In [21]:
df['quantityPerUnit'].value_counts()

quantityPerUnit
24 - 12 oz bottles     109
24 - 250 g pkgs.        73
5 kg pkg.               67
10 - 500 g pkgs.        56
24 - 200 g pkgs.        53
                      ...
24 - 8 oz jars           8
24 - 250 ml bottles      6
10 pkgs.                 6
12 - 500 g pkgs.         6
18 - 500 g pkgs.         5
Name: count, Length: 70, dtype: int64

# **3)**

In [22]:
df['customerID'].value_counts()

customerID
SAVEA    116
ERNSH    102
QUICK     86
RATTC     71
HUNGO     55
        ...
FRANR      6
BOLID      6
GROSR      4
LAZYK      2
CENTC      2
Name: count, Length: 89, dtype: int64

# **4)**

In [23]:
df['orderDate'].value_counts()

orderDate
2015-05-06    32
2015-02-26    16
2015-03-26    14
2015-04-17    14
2015-04-06    14
              ..
2013-12-10     1
2014-07-30     1
2014-07-23     1
2014-07-15     1
2014-09-03     1
Name: count, Length: 480, dtype: int64

# **5)**

In [24]:
df['requiredDate'].value_counts()

requiredDate
2015-06-03    32
2015-03-26    19
2015-04-28    17
2015-05-15    17
2015-04-23    17
              ..
2014-01-21     1
2015-03-25     1
2015-01-01     1
2014-05-15     1
2013-12-25     1
Name: count, Length: 454, dtype: int64

# **6)**

In [25]:
df['shippedDate'].value_counts()

shippedDate
2015-01-23    21
2015-04-10    21
2015-04-24    18
2014-03-14    17
2013-12-02    17
              ..
2014-03-26     1
2014-07-02     1
2014-01-31     1
2014-08-15     1
2014-06-26     1
Name: count, Length: 387, dtype: int64

# **7)**

In [32]:
df['contactName'].value_counts()

contactName
Jose Pavarotti      116
Roland Mendel       102
Horst Kloss          86
Paula Wilson         71
Patricia McKenna     55
                   ...
Carine Schmitt        6
Martín Sommer         6
Manuel Pereira        4
John Steel            2
Francisco Chang       2
Name: count, Length: 89, dtype: int64

In [35]:
#######################################################################################################################

# **Chart Based (EDA)** - Count - 8

# **SQL Based (EDA)** Count - 7

# **Chart Based (EDA)** - Count - 8

1)employeeName,

2)title,

3)categoryName,

4)description,

5)country,

6)city,

7)companyName,

8)contactTitle


# **SQL Based (EDA)** Count - 7

1) productName,

2)quantityPerUnit,

3)customerID,

4)orderDate,

5)requiredDate,

6)shippedDate,

7)contactName